#!/bin/bash
# 
# حق نشر 1392-1402 دانش پژوهان ققنوس
# حقوق این محتوی محفوظ است.
# 
# استفاده مجدد از متن و یا نتایج این اثر در هر شکل غیر قانونی است مگر اینکه متن حق
# نشر بالا در ابتدای تمامی مستندهای و یا برنامه‌های به دست آمده از این اثر
# بازنویسی شود. این کار باید برای تمامی مستندها، متنهای تبلیغاتی برنامه‌های
# کاربردی و سایر مواردی که از این اثر به دست می‌آید مندرج شده و در قسمت تقدیر از
# صاحب این اثر نام برده شود.
# 
# نام گروه دانش پژوهان ققنوس ممکن است در محصولات به دست آمده از این اثر درج
# نشود که در این حالت با مطالبی که در بالا اورده شده در تضاد نیست. برای اطلاع
# بیشتر در مورد حق نشر آدرس زیر مراجعه کنید:
# 
# http://dpq.co.ir/licenses
# 


#
# حذف نرم‌افزار
#
# فرآیند حذف با استفاده از نرم‌افزارهای مدیریت بسته سیستم عامل انجام می‌شود
# از این رو در اینجا حذف تنها به معنی از بین بردن داده‌های سیستم است که در
# طول اجرای برنامه ایجاد شده است.
#
# نکته: در حال حاضر تنها پایگاه داده از سیستم حذف می‌شود که این کار بسیار
# خطرناک است. بهتر است حذف به صورت دستی انجام شود.
#
function server_uninstall(){
	cd $SERVER_SRC_DIR
	#php $PLUF_DIR/src/migrate.php --conf=HM/conf/hm.php -a -d -x
	server_log "Trying to delete data base : %s" "$SERVER_APP_NAME"
	mysql -u root -e "drop schema if exists ${SERVER_APP_NAME};"
}